<?php
/**
 * ${product.title} ${product.version}
 *
 * Файл конфигурации
 *
 * @package Eresus
 */

/**
 * @var Eresus $Eresus;
 * @global
 */

// Включить или выключить режим отладки. По умолчанию: false
$Eresus->conf['debug']['enable'] = false;

//-------------------------------------------------------------------------------
//  Настройки источника данных (СУБД)
//-------------------------------------------------------------------------------

// Используемая СУБД. По умолчанию: 'mysql'
//$Eresus->conf['db']['engine'] = 'mysql';

// Хост сервера СУБД. По умолчанию: 'localhost'
//$Eresus->conf['db']['host'] = 'localhost';

// Имя пользователя СУБД
$Eresus->conf['db']['user'] = '';

// Пароль для доступа к СУБД
$Eresus->conf['db']['password'] = '';

// Имя базы данных
$Eresus->conf['db']['name'] = '';

// Префикс таблиц. По умолчанию: '' (без префикса)
//$Eresus->conf['db']['prefix']   = '';

//-------------------------------------------------------------------------------
//  Региональные настройки
//-------------------------------------------------------------------------------

// Код языка по умолчанию. По умолчанию: 'ru'
//$Eresus->conf['lang'] = 'ru';

// Временная зона по умолчанию
//$Eresus->conf['timezone'] = 'Europe/Moscow';

//-------------------------------------------------------------------------------
//  Настройки сессий
//-------------------------------------------------------------------------------

// Тайм-аут сессии в минутах. По умолчанию: 30
//$Eresus->conf['session']['timeout'] = 30;

//-------------------------------------------------------------------------------
//  Папки и адреса
//-------------------------------------------------------------------------------

// Корневая директория сайта. Раскомментируйте если Eresus не может определить путь самостоятельно
//$Eresus->froot = '/usr/home/site.tld/htdocs/';

// Хост сайта. Раскомментируйте если Eresus не может определить его самостоятельно
//$Eresus->host = 'example.org';

// Путь от хоста до корня сайта. Раскомментируйте если Eresus не может определить его самостоятельно
//$Eresus->path = '/site_path/';

//-------------------------------------------------------------------------------
//  Отладка и ошибки
//-------------------------------------------------------------------------------

// $Eresus->conf['debug']['mail'] - управление отсылкой почты
// = false       - отключить
// = true        - отправлять как обычно
// = <имя_файла> - записывать в файл

if ($Eresus->conf['debug']['enable'])
{
    ini_set('display_errors', true);
    error_reporting(E_ALL | E_STRICT);
    $Eresus->conf['debug']['mail'] = realpath(dirname(__FILE__)).'/../data/.sent';
}
else
{
    ini_set('display_errors', false);
    error_reporting(0);
}
